-----------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  c:\3ie\analysis\Table1_existing_pts.log
  log type:  text
 opened on:  16 Sep 2016, 17:18:40

. 
. *********************************************************************************************** 
. *********************************************************************************************** 
. * SECTION 1: CREATE TABLE 1 FOR EXISTING PATIENTS
. *********************************************************************************************** 
. *********************************************************************************************** 
. 
. ************************************************************************************************
. * TABLE 1 FOR ALL EXISTING PATIENTS
. ************************************************************************************************
. use "existing pts\3ie_exist_pts.dta", clear

. * drop record with only 1 visit in 2013
. drop if end_id==100797722
(0 observations deleted)

. * create month of last visit as offset from July 2014 (654)
. gen last_month= mofd(last_date)

. format last_month %tm

. 
. tabulate group, missing

       Group |      Freq.     Percent        Cum.
-------------+-----------------------------------
     Control |      1,226       38.92       38.92
Intervention |      1,924       61.08      100.00
-------------+-----------------------------------
       Total |      3,150      100.00

. tabulate age_cat group, missing col nofreq chi2

       Age |         Group
  category |   Control  Intervent |     Total
-----------+----------------------+----------
     <20yo |      4.81       8.16 |      6.86 
   21-30yo |     47.63      51.98 |     50.29 
   31-40yo |     40.70      35.81 |     37.71 
     >40yo |      3.51       1.72 |      2.41 
         . |      3.34       2.34 |      2.73 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(4) =  32.5340   Pr = 0.000

. tabulate marstat group, missing col nofreq chi2

      Marital |         Group
       status |   Control  Intervent |     Total
--------------+----------------------+----------
       single |      8.73       9.10 |      8.95 
married/cohab |     62.15      56.96 |     58.98 
  divor/widow |      4.24       4.26 |      4.25 
            . |     24.88      29.68 |     27.81 
--------------+----------------------+----------
        Total |    100.00     100.00 |    100.00 

          Pearson chi2(3) =   9.7363   Pr = 0.021

. tabulate who_stage group, missing col nofreq chi2

 WHO stage |
      when |
   started |         Group
       ART |   Control  Intervent |     Total
-----------+----------------------+----------
         1 |     47.96      57.54 |     53.81 
         2 |     19.74      12.89 |     15.56 
         3 |     19.98      15.75 |     17.40 
         4 |      4.40       1.98 |      2.92 
         . |      7.91      11.85 |     10.32 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(4) =  69.4553   Pr = 0.000

. tabulate cd4_cat group, missing col nofreq chi2

 cd4 count |
  category |
      when |
   started |         Group
       ART |   Control  Intervent |     Total
-----------+----------------------+----------
      <200 |     12.89      14.92 |     14.13 
   200-500 |     19.33      24.22 |     22.32 
      >500 |     13.13      13.77 |     13.52 
         . |     54.65      47.09 |     50.03 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(3) =  18.9856   Pr = 0.000

. tabulate art_year group, missing col nofreq chi2

   Year of |
       ART |         Group
initiation |   Control  Intervent |     Total
-----------+----------------------+----------
      2012 |      4.65       3.22 |      3.78 
      2013 |     24.80      26.92 |     26.10 
      2014 |     67.70      67.46 |     67.56 
      2015 |      2.85       2.39 |      2.57 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(3) =   5.9667   Pr = 0.113

. tabulate delivery_year group, missing col nofreq chi2

   Year of |         Group
  delivery |   Control  Intervent |     Total
-----------+----------------------+----------
      2013 |      9.30       8.68 |      8.92 
      2014 |     42.66      42.20 |     42.38 
      2015 |     24.63      23.91 |     24.19 
      2016 |      8.97       9.72 |      9.43 
         . |     14.44      15.49 |     15.08 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(4) =   1.5126   Pr = 0.824

. tabulate last_month group, missing col nofreq chi2

           |         Group
last_month |   Control  Intervent |     Total
-----------+----------------------+----------
    2014m7 |      0.08       0.00 |      0.03 
    2014m8 |      0.08       0.00 |      0.03 
    2014m9 |      0.08       0.00 |      0.03 
   2014m10 |      0.16       0.00 |      0.06 
   2014m11 |      0.00       0.10 |      0.06 
   2014m12 |      0.24       0.05 |      0.13 
    2015m1 |      0.08       0.26 |      0.19 
    2015m2 |      0.90       0.83 |      0.86 
    2015m3 |      1.88       2.86 |      2.48 
    2015m4 |      6.53       6.91 |      6.76 
    2015m5 |      1.71       3.17 |      2.60 
    2015m6 |      0.57       1.56 |      1.17 
    2015m7 |      1.47       1.20 |      1.30 
    2015m8 |      0.90       1.61 |      1.33 
    2015m9 |      1.55       1.82 |      1.71 
   2015m10 |      1.06       1.46 |      1.30 
   2015m11 |      1.47       1.92 |      1.75 
   2015m12 |      2.20       1.82 |      1.97 
    2016m1 |      6.04       2.81 |      4.06 
    2016m2 |     15.91       6.76 |     10.32 
    2016m3 |     41.27      44.49 |     43.24 
    2016m4 |     15.82      20.37 |     18.60 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

         Pearson chi2(21) = 124.0673   Pr = 0.000

. 
. ************************************************************************************************
. * TABLE 1 FOR CONTINUOUS EXISTING PATIENTS
. ************************************************************************************************
. use "existing pts\3ie_exist_pts.dta", clear

. * drop record with only 1 visit in 2013
. drop if end_id==100797722
(0 observations deleted)

. * create month of last visit as offset from July 2014 (654)
. gen last_month= mofd(last_date)

. format last_month %tm

. keep if continuous==1
(749 observations deleted)

. 
. tabulate group, missing

       Group |      Freq.     Percent        Cum.
-------------+-----------------------------------
     Control |        969       40.36       40.36
Intervention |      1,432       59.64      100.00
-------------+-----------------------------------
       Total |      2,401      100.00

. tabulate age_cat group, missing col nofreq chi2

       Age |         Group
  category |   Control  Intervent |     Total
-----------+----------------------+----------
     <20yo |      4.33       6.84 |      5.83 
   21-30yo |     46.65      50.77 |     49.10 
   31-40yo |     42.52      37.71 |     39.65 
     >40yo |      3.72       1.89 |      2.62 
         . |      2.79       2.79 |      2.79 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(4) =  18.9843   Pr = 0.001

. tabulate marstat group, missing col nofreq chi2

      Marital |         Group
       status |   Control  Intervent |     Total
--------------+----------------------+----------
       single |      9.29       8.38 |      8.75 
married/cohab |     61.51      56.15 |     58.31 
  divor/widow |      4.95       4.54 |      4.71 
            . |     24.25      30.94 |     28.24 
--------------+----------------------+----------
        Total |    100.00     100.00 |    100.00 

          Pearson chi2(3) =  12.7481   Pr = 0.005

. tabulate who_stage group, missing col nofreq chi2

 WHO stage |
      when |
   started |         Group
       ART |   Control  Intervent |     Total
-----------+----------------------+----------
         1 |     46.23      54.19 |     50.98 
         2 |     19.61      13.55 |     15.99 
         3 |     21.05      17.67 |     19.03 
         4 |      5.06       2.58 |      3.58 
         . |      8.05      12.01 |     10.41 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(4) =  42.5068   Pr = 0.000

. tabulate cd4_cat group, missing col nofreq chi2

 cd4 count |
  category |
      when |
   started |         Group
       ART |   Control  Intervent |     Total
-----------+----------------------+----------
      <200 |     13.11      16.41 |     15.08 
   200-500 |     20.12      24.72 |     22.87 
      >500 |     13.42      12.43 |     12.83 
         . |     53.35      46.44 |     49.23 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(3) =  15.5781   Pr = 0.001

. tabulate art_year group, missing col nofreq chi2

   Year of |
       ART |         Group
initiation |   Control  Intervent |     Total
-----------+----------------------+----------
      2012 |      5.47       3.49 |      4.29 
      2013 |     24.36      25.42 |     24.99 
      2014 |     67.49      68.78 |     68.26 
      2015 |      2.68       2.30 |      2.46 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(3) =   6.0111   Pr = 0.111

. tabulate delivery_year group, missing col nofreq chi2

   Year of |         Group
  delivery |   Control  Intervent |     Total
-----------+----------------------+----------
      2013 |      9.80       9.29 |      9.50 
      2014 |     46.23      46.58 |     46.44 
      2015 |     27.45      27.86 |     27.70 
      2016 |      8.77       8.94 |      8.87 
         . |      7.74       7.33 |      7.50 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(4) =   0.3586   Pr = 0.986

. tabulate last_month group, missing col nofreq chi2

           |         Group
last_month |   Control  Intervent |     Total
-----------+----------------------+----------
    2016m1 |      7.64       3.77 |      5.33 
    2016m2 |     20.12       9.08 |     13.54 
    2016m3 |     52.22      59.78 |     56.73 
    2016m4 |     20.02      27.37 |     24.41 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(3) =  86.9161   Pr = 0.000

. 
. ************************************************************************************************
. * TABLE 1 FOR NON-CONTINUOUS EXISTING PATIENTS
. ************************************************************************************************
. use "existing pts\3ie_exist_pts.dta", clear

. * drop record with only 1 visit in 2013
. drop if end_id==100797722
(0 observations deleted)

. * create month of last visit as offset from July 2014 (654)
. gen last_month= mofd(last_date)

. format last_month %tm

. keep if continuous==0
(2401 observations deleted)

. 
. tabulate group, missing

       Group |      Freq.     Percent        Cum.
-------------+-----------------------------------
     Control |        257       34.31       34.31
Intervention |        492       65.69      100.00
-------------+-----------------------------------
       Total |        749      100.00

. tabulate age_cat group, missing col nofreq chi2

       Age |         Group
  category |   Control  Intervent |     Total
-----------+----------------------+----------
     <20yo |      6.61      11.99 |     10.15 
   21-30yo |     51.36      55.49 |     54.07 
   31-40yo |     33.85      30.28 |     31.51 
     >40yo |      2.72       1.22 |      1.74 
         . |      5.45       1.02 |      2.54 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(4) =  21.2920   Pr = 0.000

. tabulate marstat group, missing col nofreq chi2

      Marital |         Group
       status |   Control  Intervent |     Total
--------------+----------------------+----------
       single |      6.61      11.18 |      9.61 
married/cohab |     64.59      59.35 |     61.15 
  divor/widow |      1.56       3.46 |      2.80 
            . |     27.24      26.02 |     26.44 
--------------+----------------------+----------
        Total |    100.00     100.00 |    100.00 

          Pearson chi2(3) =   6.6831   Pr = 0.083

. tabulate who_stage group, missing col nofreq chi2

 WHO stage |
      when |
   started |         Group
       ART |   Control  Intervent |     Total
-----------+----------------------+----------
         1 |     54.47      67.28 |     62.88 
         2 |     20.23      10.98 |     14.15 
         3 |     15.95      10.16 |     12.15 
         4 |      1.95       0.20 |      0.80 
         . |      7.39      11.38 |     10.01 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(4) =  28.3626   Pr = 0.000

. tabulate cd4_cat group, missing col nofreq chi2

 cd4 count |
  category |
      when |
   started |         Group
       ART |   Control  Intervent |     Total
-----------+----------------------+----------
      <200 |     12.06      10.57 |     11.08 
   200-500 |     16.34      22.76 |     20.56 
      >500 |     12.06      17.68 |     15.75 
         . |     59.53      48.98 |     52.60 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(3) =  10.6825   Pr = 0.014

. tabulate art_year group, missing col nofreq chi2

   Year of |
       ART |         Group
initiation |   Control  Intervent |     Total
-----------+----------------------+----------
      2012 |      1.56       2.44 |      2.14 
      2013 |     26.46      31.30 |     29.64 
      2014 |     68.48      63.62 |     65.29 
      2015 |      3.50       2.64 |      2.94 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(3) =   2.9874   Pr = 0.394

. tabulate delivery_year group, missing col nofreq chi2

   Year of |         Group
  delivery |   Control  Intervent |     Total
-----------+----------------------+----------
      2013 |      7.39       6.91 |      7.08 
      2014 |     29.18      29.47 |     29.37 
      2015 |     14.01      12.40 |     12.95 
      2016 |      9.73      11.99 |     11.21 
         . |     39.69      39.23 |     39.39 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(4) =   1.1788   Pr = 0.882

. tabulate last_month group, missing col nofreq chi2

           |         Group
last_month |   Control  Intervent |     Total
-----------+----------------------+----------
    2014m7 |      0.39       0.00 |      0.13 
    2014m8 |      0.39       0.00 |      0.13 
    2014m9 |      0.39       0.00 |      0.13 
   2014m10 |      0.78       0.00 |      0.27 
   2014m11 |      0.00       0.41 |      0.27 
   2014m12 |      1.17       0.20 |      0.53 
    2015m1 |      0.39       1.02 |      0.80 
    2015m2 |      4.28       3.25 |      3.60 
    2015m3 |      8.95      11.18 |     10.41 
    2015m4 |     31.13      27.03 |     28.44 
    2015m5 |      8.17      12.40 |     10.95 
    2015m6 |      2.72       6.10 |      4.94 
    2015m7 |      7.00       4.67 |      5.47 
    2015m8 |      4.28       6.30 |      5.61 
    2015m9 |      7.39       7.11 |      7.21 
   2015m10 |      5.06       5.69 |      5.47 
   2015m11 |      7.00       7.52 |      7.34 
   2015m12 |     10.51       7.11 |      8.28 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

         Pearson chi2(17) =  28.7773   Pr = 0.037

. 
. 
. ************************************************************************************************
. * TABLE 1 CONTRASTING CONTINUOUS VS. NON-CONTINUOUS FOR CONTROL PATIENTS 
. ************************************************************************************************
. use "existing pts\3ie_exist_pts.dta", clear

. * drop record with only 1 visit in 2013
. drop if end_id==100797722
(0 observations deleted)

. * create month of last visit as offset from July 2014 (654)
. gen last_month= mofd(last_date)

. format last_month %tm

. keep if group=="Control"
(1924 observations deleted)

. 
. tabulate continuous, missing

  Flags pts |
 with visit |
      after |
  31Dec2015 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        257       20.96       20.96
          1 |        969       79.04      100.00
------------+-----------------------------------
      Total |      1,226      100.00

. tabulate age_cat continuous, missing col nofreq chi2

           | Flags pts with visit
       Age |    after 31Dec2015
  category |         0          1 |     Total
-----------+----------------------+----------
     <20yo |      6.61       4.33 |      4.81 
   21-30yo |     51.36      46.65 |     47.63 
   31-40yo |     33.85      42.52 |     40.70 
     >40yo |      2.72       3.72 |      3.51 
         . |      5.45       2.79 |      3.34 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(4) =  11.7617   Pr = 0.019

. tabulate marstat continuous, missing col nofreq chi2

              | Flags pts with visit
      Marital |    after 31Dec2015
       status |         0          1 |     Total
--------------+----------------------+----------
       single |      6.61       9.29 |      8.73 
married/cohab |     64.59      61.51 |     62.15 
  divor/widow |      1.56       4.95 |      4.24 
            . |     27.24      24.25 |     24.88 
--------------+----------------------+----------
        Total |    100.00     100.00 |    100.00 

          Pearson chi2(3) =   8.2287   Pr = 0.042

. tabulate who_stage continuous, missing col nofreq chi2

 WHO stage |
      when | Flags pts with visit
   started |    after 31Dec2015
       ART |         0          1 |     Total
-----------+----------------------+----------
         1 |     54.47      46.23 |     47.96 
         2 |     20.23      19.61 |     19.74 
         3 |     15.95      21.05 |     19.98 
         4 |      1.95       5.06 |      4.40 
         . |      7.39       8.05 |      7.91 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(4) =  10.1348   Pr = 0.038

. tabulate cd4_cat continuous, missing col nofreq chi2

 cd4 count |
  category |
      when | Flags pts with visit
   started |    after 31Dec2015
       ART |         0          1 |     Total
-----------+----------------------+----------
      <200 |     12.06      13.11 |     12.89 
   200-500 |     16.34      20.12 |     19.33 
      >500 |     12.06      13.42 |     13.13 
         . |     59.53      53.35 |     54.65 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(3) =   3.3769   Pr = 0.337

. tabulate art_year continuous, missing col nofreq chi2

   Year of | Flags pts with visit
       ART |    after 31Dec2015
initiation |         0          1 |     Total
-----------+----------------------+----------
      2012 |      1.56       5.47 |      4.65 
      2013 |     26.46      24.36 |     24.80 
      2014 |     68.48      67.49 |     67.70 
      2015 |      3.50       2.68 |      2.85 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(3) =   7.5592   Pr = 0.056

. tabulate delivery_year continuous, missing col nofreq chi2

           | Flags pts with visit
   Year of |    after 31Dec2015
  delivery |         0          1 |     Total
-----------+----------------------+----------
      2013 |      7.39       9.80 |      9.30 
      2014 |     29.18      46.23 |     42.66 
      2015 |     14.01      27.45 |     24.63 
      2016 |      9.73       8.77 |      8.97 
         . |     39.69       7.74 |     14.44 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(4) = 173.8341   Pr = 0.000

. tabulate last_month continuous, missing col nofreq chi2

           | Flags pts with visit
           |    after 31Dec2015
last_month |         0          1 |     Total
-----------+----------------------+----------
    2014m7 |      0.39       0.00 |      0.08 
    2014m8 |      0.39       0.00 |      0.08 
    2014m9 |      0.39       0.00 |      0.08 
   2014m10 |      0.78       0.00 |      0.16 
   2014m12 |      1.17       0.00 |      0.24 
    2015m1 |      0.39       0.00 |      0.08 
    2015m2 |      4.28       0.00 |      0.90 
    2015m3 |      8.95       0.00 |      1.88 
    2015m4 |     31.13       0.00 |      6.53 
    2015m5 |      8.17       0.00 |      1.71 
    2015m6 |      2.72       0.00 |      0.57 
    2015m7 |      7.00       0.00 |      1.47 
    2015m8 |      4.28       0.00 |      0.90 
    2015m9 |      7.39       0.00 |      1.55 
   2015m10 |      5.06       0.00 |      1.06 
   2015m11 |      7.00       0.00 |      1.47 
   2015m12 |     10.51       0.00 |      2.20 
    2016m1 |      0.00       7.64 |      6.04 
    2016m2 |      0.00      20.12 |     15.91 
    2016m3 |      0.00      52.22 |     41.27 
    2016m4 |      0.00      20.02 |     15.82 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

         Pearson chi2(20) =  1.2e+03   Pr = 0.000

. 
. ************************************************************************************************
. * TABLE 1 CONTRASTING CONTINUOUS VS. NON-CONTINUOUS FOR INTERVENTION PATIENTS 
. ************************************************************************************************
. use "existing pts\3ie_exist_pts.dta", clear

. * drop record with only 1 visit in 2013
. drop if end_id==100797722
(0 observations deleted)

. * create month of last visit as offset from July 2014 (654)
. gen last_month= mofd(last_date)

. format last_month %tm

. keep if group=="Intervention"
(1226 observations deleted)

. 
. tabulate continuous, missing

  Flags pts |
 with visit |
      after |
  31Dec2015 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        492       25.57       25.57
          1 |      1,432       74.43      100.00
------------+-----------------------------------
      Total |      1,924      100.00

. tabulate age_cat continuous, missing col nofreq chi2

           | Flags pts with visit
       Age |    after 31Dec2015
  category |         0          1 |     Total
-----------+----------------------+----------
     <20yo |     11.99       6.84 |      8.16 
   21-30yo |     55.49      50.77 |     51.98 
   31-40yo |     30.28      37.71 |     35.81 
     >40yo |      1.22       1.89 |      1.72 
         . |      1.02       2.79 |      2.34 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(4) =  24.9919   Pr = 0.000

. tabulate marstat continuous, missing col nofreq chi2

              | Flags pts with visit
      Marital |    after 31Dec2015
       status |         0          1 |     Total
--------------+----------------------+----------
       single |     11.18       8.38 |      9.10 
married/cohab |     59.35      56.15 |     56.96 
  divor/widow |      3.46       4.54 |      4.26 
            . |     26.02      30.94 |     29.68 
--------------+----------------------+----------
        Total |    100.00     100.00 |    100.00 

          Pearson chi2(3) =   7.8095   Pr = 0.050

. tabulate who_stage continuous, missing col nofreq chi2

 WHO stage |
      when | Flags pts with visit
   started |    after 31Dec2015
       ART |         0          1 |     Total
-----------+----------------------+----------
         1 |     67.28      54.19 |     57.54 
         2 |     10.98      13.55 |     12.89 
         3 |     10.16      17.67 |     15.75 
         4 |      0.20       2.58 |      1.98 
         . |     11.38      12.01 |     11.85 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(4) =  36.5047   Pr = 0.000

. tabulate cd4_cat continuous, missing col nofreq chi2

 cd4 count |
  category |
      when | Flags pts with visit
   started |    after 31Dec2015
       ART |         0          1 |     Total
-----------+----------------------+----------
      <200 |     10.57      16.41 |     14.92 
   200-500 |     22.76      24.72 |     24.22 
      >500 |     17.68      12.43 |     13.77 
         . |     48.98      46.44 |     47.09 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(3) =  16.7949   Pr = 0.001

. tabulate art_year continuous, missing col nofreq chi2

   Year of | Flags pts with visit
       ART |    after 31Dec2015
initiation |         0          1 |     Total
-----------+----------------------+----------
      2012 |      2.44       3.49 |      3.22 
      2013 |     31.30      25.42 |     26.92 
      2014 |     63.62      68.78 |     67.46 
      2015 |      2.64       2.30 |      2.39 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(3) =   7.5884   Pr = 0.055

. tabulate delivery_year continuous, missing col nofreq chi2

           | Flags pts with visit
   Year of |    after 31Dec2015
  delivery |         0          1 |     Total
-----------+----------------------+----------
      2013 |      6.91       9.29 |      8.68 
      2014 |     29.47      46.58 |     42.20 
      2015 |     12.40      27.86 |     23.91 
      2016 |     11.99       8.94 |      9.72 
         . |     39.23       7.33 |     15.49 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(4) = 308.4334   Pr = 0.000

. tabulate delivery_year continuous, col nofreq chi2

           | Flags pts with visit
   Year of |    after 31Dec2015
  delivery |         0          1 |     Total
-----------+----------------------+----------
      2013 |     11.37      10.02 |     10.27 
      2014 |     48.49      50.26 |     49.94 
      2015 |     20.40      30.07 |     28.29 
      2016 |     19.73       9.65 |     11.50 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(3) =  30.2317   Pr = 0.000

. tabulate last_month continuous, missing col nofreq chi2

           | Flags pts with visit
           |    after 31Dec2015
last_month |         0          1 |     Total
-----------+----------------------+----------
   2014m11 |      0.41       0.00 |      0.10 
   2014m12 |      0.20       0.00 |      0.05 
    2015m1 |      1.02       0.00 |      0.26 
    2015m2 |      3.25       0.00 |      0.83 
    2015m3 |     11.18       0.00 |      2.86 
    2015m4 |     27.03       0.00 |      6.91 
    2015m5 |     12.40       0.00 |      3.17 
    2015m6 |      6.10       0.00 |      1.56 
    2015m7 |      4.67       0.00 |      1.20 
    2015m8 |      6.30       0.00 |      1.61 
    2015m9 |      7.11       0.00 |      1.82 
   2015m10 |      5.69       0.00 |      1.46 
   2015m11 |      7.52       0.00 |      1.92 
   2015m12 |      7.11       0.00 |      1.82 
    2016m1 |      0.00       3.77 |      2.81 
    2016m2 |      0.00       9.08 |      6.76 
    2016m3 |      0.00      59.78 |     44.49 
    2016m4 |      0.00      27.37 |     20.37 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

         Pearson chi2(17) =  1.9e+03   Pr = 0.000

. 
. 
. ************************************************************************************************
. *********************************************************************************************** 
. * SECTION 2: CREATE TABLE 1 FOR VISITS AMONG ALL EXISTING PATIENTS
. *********************************************************************************************** 
. ************************************************************************************************
. 
. *********************************************************************************************** 
. * TABLE 1 VISITS FOR ALL EXISTING PATIENTS
. *********************************************************************************************** 
. use "existing pts\3ie_exist_vis.dta", clear

. * drop record with only 1 visit in 2013
. drop if end_id==100797722
(0 observations deleted)

. 
. tabulate post_its, missing

   Month is |
before/afte |
r 01Sep2015 |
    for ITS |
   analyses |      Freq.     Percent        Cum.
------------+-----------------------------------
        Pre |     30,857       64.42       64.42
       Post |     16,232       33.89       98.31
          . |        808        1.69      100.00
------------+-----------------------------------
      Total |     47,897      100.00

. tabulate fac_id post_its, row nofreq missing chi2

           | Month is before/after 01Sep2015
  Facility |         for ITS analyses
      Code |       Pre       Post          . |     Total
-----------+---------------------------------+----------
         1 |     69.78      29.71       0.51 |    100.00 
         2 |     63.89      34.17       1.94 |    100.00 
         3 |     64.03      35.02       0.95 |    100.00 
         4 |     66.14      31.95       1.91 |    100.00 
         5 |     63.45      36.12       0.43 |    100.00 
         6 |     59.44      39.91       0.65 |    100.00 
         7 |     58.69      39.86       1.45 |    100.00 
         8 |     63.29      33.53       3.18 |    100.00 
         9 |     63.89      33.30       2.81 |    100.00 
        10 |     61.46      34.71       3.83 |    100.00 
        11 |     65.79      32.26       1.96 |    100.00 
        12 |     63.93      33.15       2.92 |    100.00 
        13 |     61.43      36.09       2.49 |    100.00 
        14 |     65.27      32.88       1.84 |    100.00 
        15 |     68.53      30.97       0.49 |    100.00 
        16 |     59.98      38.34       1.68 |    100.00 
        17 |     63.46      35.66       0.88 |    100.00 
        18 |     67.47      30.97       1.56 |    100.00 
        19 |     68.18      30.94       0.87 |    100.00 
        20 |     65.14      34.02       0.84 |    100.00 
        21 |     64.37      34.92       0.71 |    100.00 
        22 |     69.07      30.18       0.75 |    100.00 
        23 |     64.40      32.31       3.29 |    100.00 
        24 |     66.77      31.06       2.18 |    100.00 
-----------+---------------------------------+----------
     Total |     64.42      33.89       1.69 |    100.00 

         Pearson chi2(46) = 429.7305   Pr = 0.000

. keep if post_its==0
(17040 observations deleted)

. keep if miss !=.
(0 observations deleted)

. 
. tabulate fac_id post_its, missing nofreq row chi2

           |  Month is
           | before/aft
           |     er
           | 01Sep2015
           |  for ITS
  Facility |  analyses
      Code |       Pre |     Total
-----------+-----------+----------
         1 |    100.00 |    100.00 
         2 |    100.00 |    100.00 
         3 |    100.00 |    100.00 
         4 |    100.00 |    100.00 
         5 |    100.00 |    100.00 
         6 |    100.00 |    100.00 
         7 |    100.00 |    100.00 
         8 |    100.00 |    100.00 
         9 |    100.00 |    100.00 
        10 |    100.00 |    100.00 
        11 |    100.00 |    100.00 
        12 |    100.00 |    100.00 
        13 |    100.00 |    100.00 
        14 |    100.00 |    100.00 
        15 |    100.00 |    100.00 
        16 |    100.00 |    100.00 
        17 |    100.00 |    100.00 
        18 |    100.00 |    100.00 
        19 |    100.00 |    100.00 
        20 |    100.00 |    100.00 
        21 |    100.00 |    100.00 
        22 |    100.00 |    100.00 
        23 |    100.00 |    100.00 
        24 |    100.00 |    100.00 
-----------+-----------+----------
     Total |    100.00 |    100.00 


. tabulate num_vis group, missing chi2 nofreq col

     Total |
 number of |         Group
    visits |   Control  Intervent |     Total
-----------+----------------------+----------
         1 |      0.02       0.01 |      0.01 
         2 |      0.02       0.02 |      0.02 
         3 |      0.10       0.11 |      0.11 
         4 |      0.19       0.31 |      0.26 
         5 |      0.55       0.86 |      0.73 
         6 |      0.89       1.68 |      1.36 
         7 |      1.50       2.15 |      1.89 
         8 |      1.97       2.77 |      2.45 
         9 |      2.34       3.31 |      2.91 
        10 |      3.07       2.87 |      2.95 
        11 |      2.71       3.85 |      3.38 
        12 |      2.99       3.25 |      3.14 
        13 |      4.07       3.48 |      3.72 
        14 |      5.91       5.38 |      5.59 
        15 |      5.25       7.47 |      6.57 
        16 |      8.97       9.78 |      9.45 
        17 |     10.58      11.81 |     11.31 
        18 |     11.14       9.93 |     10.43 
        19 |     14.97      12.67 |     13.60 
        20 |     12.92       9.42 |     10.84 
        21 |      7.36       5.82 |      6.44 
        22 |      2.25       2.15 |      2.19 
        23 |      0.11       0.76 |      0.50 
        24 |      0.12       0.08 |      0.09 
        25 |      0.00       0.08 |      0.05 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

         Pearson chi2(24) = 446.2460   Pr = 0.000

. 
. tabulate group, missing

       Group |      Freq.     Percent        Cum.
-------------+-----------------------------------
     Control |     12,527       40.60       40.60
Intervention |     18,330       59.40      100.00
-------------+-----------------------------------
       Total |     30,857      100.00

. tabulate post_delivery group , missing chi2 nofreq col

  Visit is |
before/aft |
        er |         Group
  delivery |   Control  Intervent |     Total
-----------+----------------------+----------
         0 |     30.84      29.27 |     29.91 
         1 |     55.94      56.83 |     56.47 
         . |     13.22      13.90 |     13.62 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(2) =   9.6933   Pr = 0.008

. tabulate miss group , missing chi2 nofreq col

     delay |
   between |
   cleaned |
 scheduled |
  and next |         Group
    visits |   Control  Intervent |     Total
-----------+----------------------+----------
         0 |     60.84      63.03 |     62.14 
         1 |     39.16      36.97 |     37.86 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(1) =  15.1530   Pr = 0.000

. tabulate miss3 group , missing chi2 nofreq col

  delay of |
       3+d |
   between |
   cleaned |
 scheduled |
  and next |         Group
    visits |   Control  Intervent |     Total
-----------+----------------------+----------
         0 |     72.76      72.94 |     72.87 
         1 |     27.24      27.06 |     27.13 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(1) =   0.1189   Pr = 0.730

. tabulate miss7 group , missing chi2 nofreq col

  delay of |
7+ between |
   cleaned |
 scheduled |
  and next |         Group
    visits |   Control  Intervent |     Total
-----------+----------------------+----------
         0 |     82.78      80.63 |     81.50 
         1 |     17.22      19.37 |     18.50 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(1) =  22.8966   Pr = 0.000

. tabulate miss15 group , missing chi2 nofreq col

  delay of |
      15+d |
   between |
   cleaned |
 scheduled |
  and next |         Group
   visitss |   Control  Intervent |     Total
-----------+----------------------+----------
         0 |     87.48      84.42 |     85.66 
         1 |     12.52      15.58 |     14.34 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(1) =  56.8845   Pr = 0.000

. tabulate miss60 group , missing chi2 nofreq col

  delay of |
      60+d |
   between |
   cleaned |
 scheduled |
  and next |         Group
    visits |   Control  Intervent |     Total
-----------+----------------------+----------
         0 |     96.75      95.60 |     96.07 
         1 |      3.25       4.40 |      3.93 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(1) =  26.2036   Pr = 0.000

. 
. use "existing pts\3ie_exist_PDC.dta", clear

. * drop record with only 1 visit in 2013
. drop if end_id==100797722
(0 observations deleted)

. keep if post_its==0
(22912 observations deleted)

. 
. tabulate group, missing

       Group |      Freq.     Percent        Cum.
-------------+-----------------------------------
     Control |     14,518       39.31       39.31
Intervention |     22,415       60.69      100.00
-------------+-----------------------------------
       Total |     36,933      100.00

. ttest PDC , by(group)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Control |   14518     86.7349    .2214351    26.68087    86.30086    87.16894
Interven |   22415    83.39573    .1959302    29.33397    83.01169    83.77976
---------+--------------------------------------------------------------------
combined |   36933    84.70832    .1476082    28.36728    84.41901    84.99764
---------+--------------------------------------------------------------------
    diff |             3.33917    .3017096                 2.74781    3.930529
------------------------------------------------------------------------------
    diff = mean(Control) - mean(Interven)                         t =  11.0675
Ho: diff = 0                                     degrees of freedom =    36931

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. tabulate PDCge80 group , missing col nofreq chi2

PDC >= 80% |
    during |
     month |         Group
     month |   Control  Intervent |     Total
-----------+----------------------+----------
       0.0 |     18.59      23.13 |     21.34 
       1.0 |     81.41      76.87 |     78.66 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(1) = 108.0175   Pr = 0.000

. tabulate PDCge95 group , missing col nofreq chi2

PDC >= 95% |
    during |
     month |         Group
     month |   Control  Intervent |     Total
-----------+----------------------+----------
       0.0 |     30.70      36.13 |     34.00 
       1.0 |     69.30      63.87 |     66.00 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(1) = 115.8738   Pr = 0.000

. 
. *********************************************************************************************** 
. * TABLE 1 VISITS FOR CONTINUOUS EXISTING PATIENTS
. *********************************************************************************************** 
. use "existing pts\3ie_exist_vis.dta", clear

. * drop record with only 1 visit in 2013
. drop if end_id==100797722
(0 observations deleted)

. keep if continuous==1
(7069 observations deleted)

. 
. tabulate post_its, missing

   Month is |
before/afte |
r 01Sep2015 |
    for ITS |
   analyses |      Freq.     Percent        Cum.
------------+-----------------------------------
        Pre |     24,516       60.05       60.05
       Post |     15,529       38.04       98.08
          . |        783        1.92      100.00
------------+-----------------------------------
      Total |     40,828      100.00

. tabulate fac_id post_its, row nofreq missing chi2

           | Month is before/after 01Sep2015
  Facility |         for ITS analyses
      Code |       Pre       Post          . |     Total
-----------+---------------------------------+----------
         1 |     60.03      39.26       0.71 |    100.00 
         2 |     61.29      36.58       2.13 |    100.00 
         3 |     57.70      41.12       1.18 |    100.00 
         4 |     61.13      36.54       2.33 |    100.00 
         5 |     58.83      40.70       0.46 |    100.00 
         6 |     56.17      43.10       0.73 |    100.00 
         7 |     56.52      41.95       1.53 |    100.00 
         8 |     57.83      38.40       3.77 |    100.00 
         9 |     59.01      37.69       3.30 |    100.00 
        10 |     59.29      36.59       4.12 |    100.00 
        11 |     57.95      39.44       2.62 |    100.00 
        12 |     58.72      38.09       3.19 |    100.00 
        13 |     57.85      39.40       2.75 |    100.00 
        14 |     62.39      35.67       1.94 |    100.00 
        15 |     63.38      35.92       0.70 |    100.00 
        16 |     59.00      39.26       1.74 |    100.00 
        17 |     61.08      37.97       0.95 |    100.00 
        18 |     64.96      33.24       1.80 |    100.00 
        19 |     62.66      36.30       1.04 |    100.00 
        20 |     61.53      37.53       0.94 |    100.00 
        21 |     61.20      38.00       0.79 |    100.00 
        22 |     63.87      35.39       0.74 |    100.00 
        23 |     61.29      34.93       3.78 |    100.00 
        24 |     63.45      34.39       2.16 |    100.00 
-----------+---------------------------------+----------
     Total |     60.05      38.04       1.92 |    100.00 

         Pearson chi2(46) = 337.3083   Pr = 0.000

. keep if post_its==0
(16312 observations deleted)

. keep if miss !=.
(0 observations deleted)

. 
. tabulate fac_id post_its, missing nofreq row chi2

           |  Month is
           | before/aft
           |     er
           | 01Sep2015
           |  for ITS
  Facility |  analyses
      Code |       Pre |     Total
-----------+-----------+----------
         1 |    100.00 |    100.00 
         2 |    100.00 |    100.00 
         3 |    100.00 |    100.00 
         4 |    100.00 |    100.00 
         5 |    100.00 |    100.00 
         6 |    100.00 |    100.00 
         7 |    100.00 |    100.00 
         8 |    100.00 |    100.00 
         9 |    100.00 |    100.00 
        10 |    100.00 |    100.00 
        11 |    100.00 |    100.00 
        12 |    100.00 |    100.00 
        13 |    100.00 |    100.00 
        14 |    100.00 |    100.00 
        15 |    100.00 |    100.00 
        16 |    100.00 |    100.00 
        17 |    100.00 |    100.00 
        18 |    100.00 |    100.00 
        19 |    100.00 |    100.00 
        20 |    100.00 |    100.00 
        21 |    100.00 |    100.00 
        22 |    100.00 |    100.00 
        23 |    100.00 |    100.00 
        24 |    100.00 |    100.00 
-----------+-----------+----------
     Total |    100.00 |    100.00 


. tabulate num_vis group, missing chi2 nofreq col

     Total |
 number of |         Group
    visits |   Control  Intervent |     Total
-----------+----------------------+----------
         5 |      0.04       0.05 |      0.04 
         6 |      0.09       0.06 |      0.07 
         7 |      0.09       0.09 |      0.09 
         8 |      0.09       0.23 |      0.17 
         9 |      0.28       0.29 |      0.29 
        10 |      0.69       0.84 |      0.78 
        11 |      1.72       1.42 |      1.55 
        12 |      2.25       2.00 |      2.10 
        13 |      3.50       2.87 |      3.13 
        14 |      5.15       5.44 |      5.32 
        15 |      5.68       8.32 |      7.22 
        16 |      9.63      11.53 |     10.73 
        17 |     12.01      14.67 |     13.55 
        18 |     12.94      12.51 |     12.69 
        19 |     18.11      16.22 |     17.01 
        20 |     15.74      12.02 |     13.58 
        21 |      8.97       7.49 |      8.11 
        22 |      2.74       2.77 |      2.76 
        23 |      0.14       0.98 |      0.62 
        24 |      0.15       0.10 |      0.12 
        25 |      0.00       0.10 |      0.06 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

         Pearson chi2(20) = 301.8330   Pr = 0.000

. 
. tabulate group, missing

       Group |      Freq.     Percent        Cum.
-------------+-----------------------------------
     Control |     10,278       41.92       41.92
Intervention |     14,238       58.08      100.00
-------------+-----------------------------------
       Total |     24,516      100.00

. tabulate post_delivery group , missing chi2 nofreq col

  Visit is |
before/aft |
        er |         Group
  delivery |   Control  Intervent |     Total
-----------+----------------------+----------
         0 |     32.58      31.35 |     31.86 
         1 |     59.50      61.10 |     60.43 
         . |      7.92       7.55 |      7.71 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(2) =   6.4858   Pr = 0.039

. tabulate miss group , missing chi2 nofreq col

     delay |
   between |
   cleaned |
 scheduled |
  and next |         Group
    visits |   Control  Intervent |     Total
-----------+----------------------+----------
         0 |     61.74      64.22 |     63.18 
         1 |     38.26      35.78 |     36.82 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(1) =  15.6790   Pr = 0.000

. tabulate miss3 group , missing chi2 nofreq col

  delay of |
       3+d |
   between |
   cleaned |
 scheduled |
  and next |         Group
    visits |   Control  Intervent |     Total
-----------+----------------------+----------
         0 |     73.99      74.29 |     74.16 
         1 |     26.01      25.71 |     25.84 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(1) =   0.2695   Pr = 0.604

. tabulate miss7 group , missing chi2 nofreq col

  delay of |
7+ between |
   cleaned |
 scheduled |
  and next |         Group
    visits |   Control  Intervent |     Total
-----------+----------------------+----------
         0 |     84.18      82.16 |     83.01 
         1 |     15.82      17.84 |     16.99 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(1) =  17.2569   Pr = 0.000

. tabulate miss15 group , missing chi2 nofreq col

  delay of |
      15+d |
   between |
   cleaned |
 scheduled |
  and next |         Group
   visitss |   Control  Intervent |     Total
-----------+----------------------+----------
         0 |     88.81      86.04 |     87.20 
         1 |     11.19      13.96 |     12.80 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(1) =  41.1436   Pr = 0.000

. tabulate miss60 group , missing chi2 nofreq col

  delay of |
      60+d |
   between |
   cleaned |
 scheduled |
  and next |         Group
    visits |   Control  Intervent |     Total
-----------+----------------------+----------
         0 |     98.07      97.50 |     97.74 
         1 |      1.93       2.50 |      2.26 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(1) =   8.9014   Pr = 0.003

. 
. use "existing pts\3ie_exist_PDC.dta", clear

. * drop record with only 1 visit in 2013
. drop if end_id==100797722
(0 observations deleted)

. keep if post_its==0 & group !=""
(22912 observations deleted)

. keep if continuous==1
(7998 observations deleted)

. 
. tabulate group, missing

       Group |      Freq.     Percent        Cum.
-------------+-----------------------------------
     Control |     11,778       40.71       40.71
Intervention |     17,157       59.29      100.00
-------------+-----------------------------------
       Total |     28,935      100.00

. ttest PDC , by(group)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Control |   11778    86.81207    .2445594    26.54117     86.3327    87.29145
Interven |   17157    83.46512    .2229063    29.19732     83.0282    83.90204
---------+--------------------------------------------------------------------
combined |   28935     84.8275    .1657463    28.19392    84.50263    85.15237
---------+--------------------------------------------------------------------
    diff |            3.346956    .3368049                2.686803    4.007109
------------------------------------------------------------------------------
    diff = mean(Control) - mean(Interven)                         t =   9.9374
Ho: diff = 0                                     degrees of freedom =    28933

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. tabulate PDCge80 group , missing col nofreq chi2

PDC >= 80% |
    during |
     month |         Group
     month |   Control  Intervent |     Total
-----------+----------------------+----------
       0.0 |     18.60      23.06 |     21.24 
       1.0 |     81.40      76.94 |     78.76 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(1) =  82.8504   Pr = 0.000

. tabulate PDCge95 group , missing col nofreq chi2

PDC >= 95% |
    during |
     month |         Group
     month |   Control  Intervent |     Total
-----------+----------------------+----------
       0.0 |     30.75      36.22 |     34.00 
       1.0 |     69.25      63.78 |     66.00 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(1) =  93.1929   Pr = 0.000

. 
. *********************************************************************************************** 
. * TABLE 1 FOR NON-CONTINUOUS EXISTING PATIENTS
. *********************************************************************************************** 
. use "existing pts\3ie_exist_vis.dta", clear

. * drop record with only 1 visit in 2013
. drop if end_id==100797722
(0 observations deleted)

. keep if continuous==0
(40828 observations deleted)

. 
. tabulate post_its, missing

   Month is |
before/afte |
r 01Sep2015 |
    for ITS |
   analyses |      Freq.     Percent        Cum.
------------+-----------------------------------
        Pre |      6,341       89.70       89.70
       Post |        703        9.94       99.65
          . |         25        0.35      100.00
------------+-----------------------------------
      Total |      7,069      100.00

. tabulate fac_id post_its, row nofreq missing chi2

           | Month is before/after 01Sep2015
  Facility |         for ITS analyses
      Code |       Pre       Post          . |     Total
-----------+---------------------------------+----------
         1 |     89.23      10.66       0.11 |    100.00 
         2 |     89.75      10.25       0.00 |    100.00 
         3 |     90.00      10.00       0.00 |    100.00 
         4 |     89.06      10.94       0.00 |    100.00 
         5 |     91.73       8.04       0.24 |    100.00 
         6 |     86.79      13.21       0.00 |    100.00 
         7 |     86.45      13.08       0.47 |    100.00 
         8 |     92.59       7.41       0.00 |    100.00 
         9 |     89.86       9.91       0.23 |    100.00 
        10 |     90.52       9.48       0.00 |    100.00 
        11 |     88.97      11.03       0.00 |    100.00 
        12 |     92.40       6.16       1.44 |    100.00 
        13 |     95.00       5.00       0.00 |    100.00 
        14 |     90.42       8.63       0.96 |    100.00 
        15 |     80.66      19.34       0.00 |    100.00 
        16 |     85.71      14.29       0.00 |    100.00 
        17 |     95.15       4.85       0.00 |    100.00 
        18 |     83.78      16.22       0.00 |    100.00 
        19 |     91.05       8.78       0.17 |    100.00 
        20 |     95.04       4.96       0.00 |    100.00 
        21 |     90.61       9.39       0.00 |    100.00 
        22 |     85.55      13.67       0.78 |    100.00 
        23 |     85.00      15.00       0.00 |    100.00 
        24 |     89.53       8.14       2.33 |    100.00 
-----------+---------------------------------+----------
     Total |     89.70       9.94       0.35 |    100.00 

         Pearson chi2(46) = 133.4725   Pr = 0.000

. keep if post_its==0
(728 observations deleted)

. keep if miss !=.
(0 observations deleted)

. 
. tabulate fac_id post_its, missing nofreq row chi2

           |  Month is
           | before/aft
           |     er
           | 01Sep2015
           |  for ITS
  Facility |  analyses
      Code |       Pre |     Total
-----------+-----------+----------
         1 |    100.00 |    100.00 
         2 |    100.00 |    100.00 
         3 |    100.00 |    100.00 
         4 |    100.00 |    100.00 
         5 |    100.00 |    100.00 
         6 |    100.00 |    100.00 
         7 |    100.00 |    100.00 
         8 |    100.00 |    100.00 
         9 |    100.00 |    100.00 
        10 |    100.00 |    100.00 
        11 |    100.00 |    100.00 
        12 |    100.00 |    100.00 
        13 |    100.00 |    100.00 
        14 |    100.00 |    100.00 
        15 |    100.00 |    100.00 
        16 |    100.00 |    100.00 
        17 |    100.00 |    100.00 
        18 |    100.00 |    100.00 
        19 |    100.00 |    100.00 
        20 |    100.00 |    100.00 
        21 |    100.00 |    100.00 
        22 |    100.00 |    100.00 
        23 |    100.00 |    100.00 
        24 |    100.00 |    100.00 
-----------+-----------+----------
     Total |    100.00 |    100.00 


. tabulate num_vis group, missing chi2 nofreq col

     Total |
 number of |         Group
    visits |   Control  Intervent |     Total
-----------+----------------------+----------
         1 |      0.09       0.02 |      0.05 
         2 |      0.13       0.10 |      0.11 
         3 |      0.58       0.51 |      0.54 
         4 |      1.07       1.37 |      1.26 
         5 |      2.89       3.67 |      3.39 
         6 |      4.54       7.33 |      6.34 
         7 |      7.96       9.34 |      8.85 
         8 |     10.58      11.61 |     11.24 
         9 |     11.74      13.78 |     13.06 
        10 |     13.92       9.95 |     11.35 
        11 |      7.20      12.29 |     10.49 
        12 |      6.40       7.58 |      7.16 
        13 |      6.67       5.62 |      5.99 
        14 |      9.38       5.16 |      6.66 
        15 |      3.29       4.50 |      4.07 
        16 |      5.96       3.71 |      4.51 
        17 |      4.05       1.83 |      2.62 
        18 |      2.93       0.98 |      1.67 
        19 |      0.62       0.29 |      0.41 
        20 |      0.00       0.37 |      0.24 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

         Pearson chi2(19) = 226.4561   Pr = 0.000

. 
. tabulate group, missing

       Group |      Freq.     Percent        Cum.
-------------+-----------------------------------
     Control |      2,249       35.47       35.47
Intervention |      4,092       64.53      100.00
-------------+-----------------------------------
       Total |      6,341      100.00

. tabulate post_delivery group , missing chi2 nofreq col

  Visit is |
before/aft |
        er |         Group
  delivery |   Control  Intervent |     Total
-----------+----------------------+----------
         0 |     22.85      22.04 |     22.33 
         1 |     39.71      41.96 |     41.16 
         . |     37.44      36.00 |     36.51 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(2) =   3.0449   Pr = 0.218

. tabulate miss group , missing chi2 nofreq col

     delay |
   between |
   cleaned |
 scheduled |
  and next |         Group
    visits |   Control  Intervent |     Total
-----------+----------------------+----------
         0 |     56.74      58.92 |     58.15 
         1 |     43.26      41.08 |     41.85 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(1) =   2.8433   Pr = 0.092

. tabulate miss3 group , missing chi2 nofreq col

  delay of |
       3+d |
   between |
   cleaned |
 scheduled |
  and next |         Group
    visits |   Control  Intervent |     Total
-----------+----------------------+----------
         0 |     67.14      68.26 |     67.86 
         1 |     32.86      31.74 |     32.14 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(1) =   0.8261   Pr = 0.363

. tabulate miss7 group , missing chi2 nofreq col

  delay of |
7+ between |
   cleaned |
 scheduled |
  and next |         Group
    visits |   Control  Intervent |     Total
-----------+----------------------+----------
         0 |     76.39      75.29 |     75.68 
         1 |     23.61      24.71 |     24.32 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(1) =   0.9477   Pr = 0.330

. tabulate miss15 group , missing chi2 nofreq col

  delay of |
      15+d |
   between |
   cleaned |
 scheduled |
  and next |         Group
   visitss |   Control  Intervent |     Total
-----------+----------------------+----------
         0 |     81.41      78.79 |     79.72 
         1 |     18.59      21.21 |     20.28 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(1) =   6.1907   Pr = 0.013

. tabulate miss60 group , missing chi2 nofreq col

  delay of |
      60+d |
   between |
   cleaned |
 scheduled |
  and next |         Group
    visits |   Control  Intervent |     Total
-----------+----------------------+----------
         0 |     90.71      88.98 |     89.59 
         1 |      9.29      11.02 |     10.41 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(1) =   4.6499   Pr = 0.031

. 
. use "existing pts\3ie_exist_PDC.dta", clear

. * drop record with only 1 visit in 2013
. drop if end_id==100797722
(0 observations deleted)

. keep if post_its==0 & group !=""
(22912 observations deleted)

. keep if continuous==0
(28935 observations deleted)

. 
. tabulate group, missing

       Group |      Freq.     Percent        Cum.
-------------+-----------------------------------
     Control |      2,740       34.26       34.26
Intervention |      5,258       65.74      100.00
-------------+-----------------------------------
       Total |      7,998      100.00

. ttest PDC , by(group)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Control |    2740    86.40315    .5210745    27.27565    85.38141    87.42489
Interven |    5258     83.1693    .4106514    29.77718    82.36425    83.97435
---------+--------------------------------------------------------------------
combined |    7998    84.27717    .3240859     28.9835    83.64188    84.91246
---------+--------------------------------------------------------------------
    diff |            3.233845    .6819827                1.896981    4.570708
------------------------------------------------------------------------------
    diff = mean(Control) - mean(Interven)                         t =   4.7418
Ho: diff = 0                                     degrees of freedom =     7996

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. tabulate PDCge80 group , missing col nofreq chi2

PDC >= 80% |
    during |
     month |         Group
     month |   Control  Intervent |     Total
-----------+----------------------+----------
       0.0 |     18.54      23.35 |     21.71 
       1.0 |     81.46      76.65 |     78.29 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(1) =  24.5717   Pr = 0.000

. tabulate PDCge95 group , missing col nofreq chi2

PDC >= 95% |
    during |
     month |         Group
     month |   Control  Intervent |     Total
-----------+----------------------+----------
       0.0 |     30.47      35.83 |     34.00 
       1.0 |     69.53      64.17 |     66.00 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(1) =  23.0346   Pr = 0.000

. 
. *********************************************************************************************** 
. * TABLE 1 CONTRASTING CONTINUOUS VS. NON-CONTINUOUS FOR EXISTING CONTROL PATIENTS
. *********************************************************************************************** 
. use "existing pts\3ie_exist_vis.dta", clear

. * drop record with only 1 visit in 2013
. drop if end_id==100797722
(0 observations deleted)

. keep if group=="Control"
(28787 observations deleted)

. keep if post_its==0
(6583 observations deleted)

. keep if miss !=.
(0 observations deleted)

. 
. tabulate fac_id post_its, missing nofreq row chi2

           |  Month is
           | before/aft
           |     er
           | 01Sep2015
           |  for ITS
  Facility |  analyses
      Code |       Pre |     Total
-----------+-----------+----------
        13 |    100.00 |    100.00 
        14 |    100.00 |    100.00 
        15 |    100.00 |    100.00 
        16 |    100.00 |    100.00 
        17 |    100.00 |    100.00 
        18 |    100.00 |    100.00 
        19 |    100.00 |    100.00 
        20 |    100.00 |    100.00 
        21 |    100.00 |    100.00 
        22 |    100.00 |    100.00 
        23 |    100.00 |    100.00 
        24 |    100.00 |    100.00 
-----------+-----------+----------
     Total |    100.00 |    100.00 


. 
. tabulate continuous, missing

  Flags pts |
 with visit |
      after |
  31Dec2015 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,249       17.95       17.95
          1 |     10,278       82.05      100.00
------------+-----------------------------------
      Total |     12,527      100.00

. tabulate post_delivery continuous , missing chi2 nofreq col

  Visit is |
before/aft | Flags pts with visit
        er |    after 31Dec2015
  delivery |         0          1 |     Total
-----------+----------------------+----------
         0 |     22.85      32.58 |     30.84 
         1 |     39.71      59.50 |     55.94 
         . |     37.44       7.92 |     13.22 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(2) =  1.4e+03   Pr = 0.000

. tabulate miss continuous , missing chi2 nofreq col

     delay |
   between |
   cleaned |
 scheduled | Flags pts with visit
  and next |    after 31Dec2015
    visits |         0          1 |     Total
-----------+----------------------+----------
         0 |     56.74      61.74 |     60.84 
         1 |     43.26      38.26 |     39.16 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(1) =  19.4190   Pr = 0.000

. tabulate miss3 continuous , missing chi2 nofreq col

  delay of |
       3+d |
   between |
   cleaned |
 scheduled | Flags pts with visit
  and next |    after 31Dec2015
    visits |         0          1 |     Total
-----------+----------------------+----------
         0 |     67.14      73.99 |     72.76 
         1 |     32.86      26.01 |     27.24 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(1) =  43.7139   Pr = 0.000

. tabulate miss7 continuous , missing chi2 nofreq col

  delay of |
7+ between |
   cleaned |
 scheduled | Flags pts with visit
  and next |    after 31Dec2015
    visits |         0          1 |     Total
-----------+----------------------+----------
         0 |     76.39      84.18 |     82.78 
         1 |     23.61      15.82 |     17.22 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(1) =  78.5641   Pr = 0.000

. tabulate miss15 continuous , missing chi2 nofreq col

  delay of |
      15+d |
   between |
   cleaned |
 scheduled | Flags pts with visit
  and next |    after 31Dec2015
   visitss |         0          1 |     Total
-----------+----------------------+----------
         0 |     81.41      88.81 |     87.48 
         1 |     18.59      11.19 |     12.52 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(1) =  92.2041   Pr = 0.000

. tabulate miss60 continuous , missing chi2 nofreq col

  delay of |
      60+d |
   between |
   cleaned |
 scheduled | Flags pts with visit
  and next |    after 31Dec2015
    visits |         0          1 |     Total
-----------+----------------------+----------
         0 |     90.71      98.07 |     96.75 
         1 |      9.29       1.93 |      3.25 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(1) = 318.5512   Pr = 0.000

. 
. use "existing pts\3ie_exist_PDC.dta", clear

. * drop record with only 1 visit in 2013
. drop if end_id==100797722
(0 observations deleted)

. keep if group=="Control"
(36255 observations deleted)

. keep if post_its==0
(9072 observations deleted)

. 
. tabulate continuous, missing

  Flags pts |
 with visit |
      after |
  31Dec2015 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,740       18.87       18.87
          1 |     11,778       81.13      100.00
------------+-----------------------------------
      Total |     14,518      100.00

. ttest PDC , by(continuous)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |    2740    86.40315    .5210745    27.27565    85.38141    87.42489
       1 |   11778    86.81207    .2445594    26.54117     86.3327    87.29145
---------+--------------------------------------------------------------------
combined |   14518     86.7349    .2214351    26.68087    86.30086    87.16894
---------+--------------------------------------------------------------------
    diff |           -.4089278    .5659127               -1.518189    .7003332
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -0.7226
Ho: diff = 0                                     degrees of freedom =    14516

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.2350         Pr(|T| > |t|) = 0.4699          Pr(T > t) = 0.7650

. tabulate PDCge80 continuous , missing col nofreq chi2

PDC >= 80% |
    during | Flags pts with visit
     month |    after 31Dec2015
     month |         0          1 |     Total
-----------+----------------------+----------
       0.0 |     18.54      18.60 |     18.59 
       1.0 |     81.46      81.40 |     81.41 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(1) =   0.0057   Pr = 0.940

. tabulate PDCge95 continuous , missing col nofreq chi2

PDC >= 95% |
    during | Flags pts with visit
     month |    after 31Dec2015
     month |         0          1 |     Total
-----------+----------------------+----------
       0.0 |     30.47      30.75 |     30.70 
       1.0 |     69.53      69.25 |     69.30 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(1) =   0.0806   Pr = 0.776

. 
. *********************************************************************************************** 
. * TABLE 1 CONTRASTING CONTINUOUS VS. NON-CONTINUOUS FOR EXISTING INTERVENTION PATIENTS
. *********************************************************************************************** 
. use "existing pts\3ie_exist_vis.dta", clear

. * drop record with only 1 visit in 2013
. drop if end_id==100797722
(0 observations deleted)

. keep if group=="Intervention"
(19110 observations deleted)

. keep if post_its==0
(10457 observations deleted)

. keep if miss !=.
(0 observations deleted)

. 
. tabulate fac_id post_its, missing nofreq row chi2

           |  Month is
           | before/aft
           |     er
           | 01Sep2015
           |  for ITS
  Facility |  analyses
      Code |       Pre |     Total
-----------+-----------+----------
         1 |    100.00 |    100.00 
         2 |    100.00 |    100.00 
         3 |    100.00 |    100.00 
         4 |    100.00 |    100.00 
         5 |    100.00 |    100.00 
         6 |    100.00 |    100.00 
         7 |    100.00 |    100.00 
         8 |    100.00 |    100.00 
         9 |    100.00 |    100.00 
        10 |    100.00 |    100.00 
        11 |    100.00 |    100.00 
        12 |    100.00 |    100.00 
-----------+-----------+----------
     Total |    100.00 |    100.00 


. 
. tabulate continuous, missing

  Flags pts |
 with visit |
      after |
  31Dec2015 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,092       22.32       22.32
          1 |     14,238       77.68      100.00
------------+-----------------------------------
      Total |     18,330      100.00

. tabulate post_delivery continuous , missing chi2 nofreq col

  Visit is |
before/aft | Flags pts with visit
        er |    after 31Dec2015
  delivery |         0          1 |     Total
-----------+----------------------+----------
         0 |     22.04      31.35 |     29.27 
         1 |     41.96      61.10 |     56.83 
         . |     36.00       7.55 |     13.90 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(2) =  2.1e+03   Pr = 0.000

. tabulate miss continuous , missing chi2 nofreq col

     delay |
   between |
   cleaned |
 scheduled | Flags pts with visit
  and next |    after 31Dec2015
    visits |         0          1 |     Total
-----------+----------------------+----------
         0 |     58.92      64.22 |     63.03 
         1 |     41.08      35.78 |     36.97 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(1) =  38.2541   Pr = 0.000

. tabulate miss3 continuous , missing chi2 nofreq col

  delay of |
       3+d |
   between |
   cleaned |
 scheduled | Flags pts with visit
  and next |    after 31Dec2015
    visits |         0          1 |     Total
-----------+----------------------+----------
         0 |     68.26      74.29 |     72.94 
         1 |     31.74      25.71 |     27.06 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(1) =  58.5942   Pr = 0.000

. tabulate miss7 continuous , missing chi2 nofreq col

  delay of |
7+ between |
   cleaned |
 scheduled | Flags pts with visit
  and next |    after 31Dec2015
    visits |         0          1 |     Total
-----------+----------------------+----------
         0 |     75.29      82.16 |     80.63 
         1 |     24.71      17.84 |     19.37 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(1) =  95.9634   Pr = 0.000

. tabulate miss15 continuous , missing chi2 nofreq col

  delay of |
      15+d |
   between |
   cleaned |
 scheduled | Flags pts with visit
  and next |    after 31Dec2015
   visitss |         0          1 |     Total
-----------+----------------------+----------
         0 |     78.79      86.04 |     84.42 
         1 |     21.21      13.96 |     15.58 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(1) = 126.9991   Pr = 0.000

. tabulate miss60 continuous , missing chi2 nofreq col

  delay of |
      60+d |
   between |
   cleaned |
 scheduled | Flags pts with visit
  and next |    after 31Dec2015
    visits |         0          1 |     Total
-----------+----------------------+----------
         0 |     88.98      97.50 |     95.60 
         1 |     11.02       2.50 |      4.40 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(1) = 548.3552   Pr = 0.000

. 
. use "existing pts\3ie_exist_PDC.dta", clear

. * drop record with only 1 visit in 2013
. drop if end_id==100797722
(0 observations deleted)

. keep if group=="Intervention"
(23590 observations deleted)

. keep if post_its==0
(13840 observations deleted)

. 
. tabulate continuous, missing

  Flags pts |
 with visit |
      after |
  31Dec2015 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,258       23.46       23.46
          1 |     17,157       76.54      100.00
------------+-----------------------------------
      Total |     22,415      100.00

. ttest PDC , by(continuous)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |    5258     83.1693    .4106514    29.77718    82.36425    83.97435
       1 |   17157    83.46512    .2229063    29.19732     83.0282    83.90204
---------+--------------------------------------------------------------------
combined |   22415    83.39573    .1959302    29.33397    83.01169    83.77976
---------+--------------------------------------------------------------------
    diff |           -.2958164     .462397               -1.202147     .610514
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -0.6397
Ho: diff = 0                                     degrees of freedom =    22413

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.2612         Pr(|T| > |t|) = 0.5223          Pr(T > t) = 0.7388

. tabulate PDCge80 continuous , missing col nofreq chi2

PDC >= 80% |
    during | Flags pts with visit
     month |    after 31Dec2015
     month |         0          1 |     Total
-----------+----------------------+----------
       0.0 |     23.35      23.06 |     23.13 
       1.0 |     76.65      76.94 |     76.87 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(1) =   0.2000   Pr = 0.655

. tabulate PDCge95 continuous , missing col nofreq chi2

PDC >= 95% |
    during | Flags pts with visit
     month |    after 31Dec2015
     month |         0          1 |     Total
-----------+----------------------+----------
       0.0 |     35.83      36.22 |     36.13 
       1.0 |     64.17      63.78 |     63.87 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(1) =   0.2696   Pr = 0.604

. 
. log close
      name:  <unnamed>
       log:  c:\3ie\analysis\Table1_existing_pts.log
  log type:  text
 closed on:  16 Sep 2016, 17:18:43
-----------------------------------------------------------------------------------------------------------------------------------------------
